#pragma once
#include "../sdk.h"

#include "../tools/math.h"
#include "../tools/memory/memory.h"
#include "../tools/netvar_parser.h"

#include "../other/game_functions.h"

#include "../global_context.h"

#define backup_globals(name) float prev_##name = interfaces::global_vars->##name
#define restore_globals(name) interfaces::global_vars->##name = prev_##name

enum bone_mask_t {
	bone_used_mask = 0x000FFF00,
	bone_used_by_anything = 0x000FFF00,
	bone_used_by_hitbox = 0x00000100,
	bone_used_by_attachment = 0x00000200,
	bone_used_by_vertex_mask = 0x0003FC00,
	bone_used_by_vertex_lod0 = 0x00000400,
	bone_used_by_vertex_lod1 = 0x00000800,
	bone_used_by_vertex_lod2 = 0x00001000,
	bone_used_by_vertex_lod3 = 0x00002000,
	bone_used_by_vertex_lod4 = 0x00004000,
	bone_used_by_vertex_lod5 = 0x00008000,
	bone_used_by_vertex_lod6 = 0x00010000,
	bone_used_by_vertex_lod7 = 0x00020000,
	bone_used_by_bone_merge = 0x00040000,
	bone_always_setup = 0x00080000,
};

enum entity_flags_t {
	fl_onground = (1 << 0),
	fl_ducking = (1 << 1),
	fl_waterjump = (1 << 3),
	fl_ontrain = (1 << 4),
	fl_inrain = (1 << 5),
	fl_frozen = (1 << 6),
	fl_atcontrols = (1 << 7),
	fl_client = (1 << 8),
	fl_fakeclient = (1 << 9),
	fl_inwater = (1 << 10),
};

enum fieldtype_t {
	field_void = 0,
	field_float,
	field_string,
	field_vector,
	field_quaternion,
	field_integer,
	field_boolean,
	field_short,
	field_character,
	field_color32,
	field_embedded,
	field_custom,
	field_classptr,
	field_ehandle,
	field_edict,

	weapon_elite = 2,
	weapon_fiveseven = 3,
	weapon_glock = 4,
	weapon_ak47 = 7,
	weapon_aug = 8,
	weapon_awp = 9,
	weapon_famas = 10,
	weapon_g3sg1 = 11,
	weapon_galilar = 13,
	weapon_m249 = 14,
	weapon_m4a1 = 16,
	weapon_mac10 = 17,
	weapon_p90 = 19,
	weapon_zone_repulsor = 20,
	weapon_mp5sd = 23,
	weapon_ump45 = 24,
	weapon_xm1014 = 25,
	weapon_bizon = 26,
	weapon_mag7 = 27,
	weapon_negev = 28,
	weapon_sawedoff = 29,
	weapon_tec9 = 30,
	weapon_taser = 31,
	weapon_hkp2000 = 32,
	weapon_mp7 = 33,
	weapon_mp9 = 34,
	weapon_nova = 35,
	weapon_p250 = 36,
	weapon_shield = 37,
	weapon_scar20 = 38,
	weapon_sg556 = 39,
	weapon_ssg08 = 40,
	weapon_knife_gg = 41,
	weapon_knife = 42,
	weapon_flashbang = 43,
	weapon_hegrenade = 44,
	weapon_smokegrenade = 45,
	weapon_molotov = 46,
	weapon_decoy = 47,
	weapon_incgrenade = 48,
	weapon_c4 = 49,
	weapon_healthshot = 57,
	weapon_knife_t = 59,
	weapon_m4a1_silencer = 60,
	weapon_usp_silencer = 61,
	weapon_cz75a = 63,
	weapon_revolver = 64,
	weapon_tagrenade = 68,
	weapon_fists = 69,
	weapon_breachcharge = 70,
	weapon_tablet = 72,
	weapon_melee = 74,
	weapon_axe = 75,
	weapon_hammer = 76,
	weapon_spanner = 78,
	weapon_knife_ghost = 80,
	weapon_firebomb = 81,
	weapon_diversion = 82,
	weapon_frag_grenade = 83,
	weapon_snowball = 84,
	weapon_bumpmine = 85,
	weapon_knife_bayonet = 500,
	weapon_knife_css = 503,
	weapon_knife_flip = 505,
	weapon_knife_gut = 506,
	weapon_knife_karambit = 507,
	weapon_knife_m9_bayonet = 508,
	weapon_knife_tactical = 509,
	weapon_knife_falchion = 512,
	weapon_knife_survival_bowie = 514,
	weapon_knife_butterfly = 515,
	weapon_knife_push = 516,
	weapon_knife_cord = 517,
	weapon_knife_canis = 518,
	weapon_knife_ursus = 519,
	weapon_knife_gypsy_jackknife = 520,
	weapon_knife_outdoor = 521,
	weapon_knife_stiletto = 522,
	weapon_knife_widowmaker = 523,
	weapon_knife_skeleton = 525,
	glove_studded_brokenfang = 4725,
	glove_studded_bloodhound = 5027,
	glove_t = 5028,
	glove_ct = 5029,
	glove_sporty = 5030,
	glove_slick = 5031,
	glove_leather_handwraps = 5032,
	glove_motorcycle = 5033,
	glove_specialist = 5034,
	glove_studded_hydra = 5035,
};

enum animation_layer_t {
	animation_layer_aimmatrix = 0,
	animation_layer_weapon_action,
	animation_layer_weapon_action_recrouch,
	animation_layer_adjust,
	animation_layer_movement_jump_or_fall,
	animation_layer_movement_land_or_climb,
	animation_layer_movement_move,
	animation_layer_movement_strafechange,
	animation_layer_whole_body,
	animation_layer_flashed,
	animation_layer_flinch,
	animation_layer_aliveloop,
	animation_layer_lean,
	animation_layer_count
};

enum observer_type_t {
	obs_mode_none,
	obs_mode_deathcam,
	obs_mode_freezecam,
	obs_mode_fixed,
	obs_mode_in_eye,
	obs_mode_chase,
	obs_mode_roaming,

	num_observer_modes,
};

class c_baseentity;
class c_csplayer;
class c_basecombatweapon;

class c_renderable;
class c_networkable;
class c_thinkable;
class c_unknown;
class c_client_entity;
class c_type_description;

struct datamap_t;
struct inputdata_t;

struct color24_t
{
	unsigned char r{}, g{}, b{};
};

struct ret_counted_t {
private:
	volatile long m_ref_count;
public:
	virtual void destructor(char bDelete) = 0;
	virtual bool on_final_release() = 0;

	void unref() {
		if (InterlockedDecrement(&m_ref_count) == 0 && on_final_release())
			destructor(1);
	}
};

class c_bone_accessor {
public:
	alignas(16) matrix3x4_t* bones{};

	int readable_bones{};
	int writable_bones{};
};

class c_collision_property {
public:
	padding(0x8);

	vector3d mins{};
	vector3d maxs{};
};

struct cmd_context_t {
	bool		needs_processing{};
	c_usercmd	user_cmd{};
	int			cmd_number{};
};

class c_type_description {
public:
	int							field_type{};
	const char* field_name{};
	int							field_offset{};
	unsigned short				fiels_size{};
	short						flags{};

	const char* external_name{};

	void* restore_ops{};
	void* input_func{};

	datamap_t* td{};

	int							field_size_in_butes{};

	class c_type_description* override_field{};

	int							override_count{};

	float						field_tolerance{};

	int							flat_offset[td_offset_count]{};
	unsigned short				flat_group{};
};

struct datamap_t {
	c_type_description* data_desc{};
	int						data_num_fields{};
	const char* data_class_name{};
	datamap_t* base_map{};
	int						packed_size{};
	void* optimized_data_map{};
};

unsigned int find_in_datamap(datamap_t* map, const char* name);

struct weapon_info_t
{
	char pad_0000[20];                 // 0x0000
	uint32_t max_ammo_1;                  // 0x0014
	char pad_0018[12];                 // 0x0018
	uint32_t max_ammo_2;                  // 0x0024
	char pad_0028[84];                 // 0x0028
	char* N00000985;                      // 0x007C
	char pad_0080[8];                  // 0x0080
	char* hud_name;                       // 0x0088
	char* weapon_name;                    // 0x008C
	char pad_0090[56];                 // 0x0090
	uint32_t weapon_type;                 // 0x00C8
	char pad_00CC[4];
	int weapon_price;
	int kill_award;
	char* animation_prefix;
	float cycle_time;
	float cycle_time_alt;
	float time_to_idle;
	float idle_interval;
	bool full_auto;
	char pad_0x00e5[3];
	uint32_t dmg;                         // 0x00F0
	float crosshair_delta_distance;       // 0x00F4
	float armor_ratio;                    // 0x00F8
	uint32_t bullets;                     // 0x00FC
	float penetration;                    // 0x0100
	float flinch_velocity_modifier_large; // 0x0104
	float flinch_velocity_modifier_small; // 0x0108
	float range;                          // 0x010C
	float range_modifier;                 // 0x0110
	float throw_velocity;                 // 0x0114
	char pad_0118[20];                 // 0x0118
	uint32_t crosshair_delta_dist;        // 0x012C
	uint32_t crosshair_min_dist;          // 0x0130
	float max_speed;                      // 0x0134
	float max_speed_alt;                  // 0x0138
	char pad_013C[12];                 // 0x013C
	float inaccuracy_crouch;              // 0x0148
	float inaccuracy_crouch_alt;          // 0x014C
	float inaccuracy_stand;               // 0x0150
	float inaccuracy_stand_alt;           // 0x0154
	float inaccuracy_jump;                // 0x0158
	float inaccuracy_jump_alt;            // 0x015C
	float inaccuracy_land;                // 0x0160
	float inaccuracy_land_alt;            // 0x0164
	char pad_0168[96];                 // 0x0168
	bool unk;                             // 0x01C8
	char pad_0169[4];                     // 0x01C9
	bool hide_viewmodel_in_zoom;          // 0x01CD
};

class c_weapon_system
{
protected:
	~c_weapon_system() = default;

private:
	virtual void pad0() = 0;
	virtual void pad1() = 0;

public:
	virtual weapon_info_t* get_weapon_data(uint32_t item_definition_index) = 0;
};

class c_animation_layers {
public:
	bool		client_blend{};
	float		blend_in{};
	void* studio_hdr{};

	int			dispatch_sequence{};
	int			second_dispatch_sequence{};

	uint32_t	order{};
	uint32_t	sequence{};

	float		prev_cycle{};
	float		weight{};
	float		weight_delta_rate{};
	float		playback_rate{};
	float		cycle{};

	void* owner{};

	padding(4);
};

class c_game_rules {
public:
	bool is_valve_ds() {
		if (!this)
			return false;
		return *(bool*)((uintptr_t)this + 0x7C);
	}

	bool is_freeze_time() {
		if (!this)
			return false;
		return *(bool*)((uintptr_t)this + 0x20);
	}
};

class c_ikcontext {
public:
	void constructor() {
		using fn = void(__thiscall*)(void*);
